#+title: Exploring gapminder 1
#+author: Marcus Birkenkrahe
#+subtitle: Practice notebook for DSC 205 Spring 2022
#+options: toc:nil ^:nil
#+startup: hideblocks overview
#+property: header-args:R :session *R*
#+property: header-args:R :results output
#+property: header-args:R :exports both
* Getting the data

  * We need to install some things first. Don't just click through
    these commands but make absolutely sure that you really understand
    every step and every command.

  * If you really understand a command in R, you know what the
    alternative paths are. There is always at least one alternative
    way of getting what you want in R (this is true for all good
    programming languages).

  * [ ] To be able to run the installation inside Org-mode (and see
    the output here), I put one line in my ~.Rprofile~. This file will
    be fetched by Emacs + ESS, so it needs to be placed in the Emacs
    HOME directory. You can also run the code right now.

    #+name: optionsRepos
    #+begin_src R :session *R* :results silent
      options(repos=c("https://cloud.r-project.org/"))
    #+end_src

  * [X] Check where your computer gets its CRAN packages from. If you
    put the code [[optionsRepos]] into ~.Rprofile~, you should get the
    nearest mirror.

    #+begin_src R :exports both :session :results output
      getOption("repos")
    #+end_src

    #+RESULTS:
    : [1] "https://cloud.r-project.org/"


  * [X] We need a couple of packages and a dataset. Put the code in
    [[lockAndLoad]] below and run it:

    1) Install the ~tidyverse~ and the ~dslabs~ packages
    2) Load the ~tidyverse~ and the ~dslabs~ packages
    3) Load the ~gapminder~ dataset from the ~dslabs~ package

    #+name: lockAndLoad
    #+begin_src R :exports both :session :results silent





    #+end_src

  * [ ] Check which packages were loaded.
    
    #+begin_src R :exports both :session :results output

    #+end_src    

    - I set the output of [[lockAndLoad]] to ~silent~. If you want to see
      what R did, check the R console session in the ~*R*~ buffer.

    - [[https://www.gapminder.org/data/][The original Gapminder data set]] is much larger than the
      [[https://cran.r-project.org/web/packages/gapminder/README.html][subset at CRAN]] or the dslabs dataset.

  * [X] Check ~??gapminder~ in the R console to see how many gapminder
    data sets you have available for loading.

  * [X] If you looked at the output of the ~data~ loading command, you
    may have noticed that the data display is messed up with control
    characters. If this happens with a familiar command (e.g. ~str~)
    it's to with the "tibble" format that "Tidyverse" data frames come
    in. To get rid of the extra characters, run this command (or
    better put it into your .Rprofile:

    #+begin_src R :results silent
     options(crayon.enabled = FALSE)
    #+end_src
    Tibbles are limited to 10 rows by default.

  * [X] If [[lockAndLoad]] ran successfully, I recommend you go back to
    the code block and comment the ~install.packages~
    commands. Otherwise, your workbook may attempt to re-install them.

  * [X] You don't need to re-install packages unless a) you upgraded
    to a different version of R, or b) the package was upgraded.

    You can update your installed packages with one command (Wasser,
    2021). You should do this on the console - answer "Yes" always.

    Check the (local) ~update.packages()~ reference for additional
    options and commands. You can run the commmand below in the R
    console.

    #+name: updatePackages
    #+begin_example R
      update.packages()
    #+end_example

